@mogul maybe this is fine, but it's not really what we want. When it tries to create the new zone it's probably going to fail because one already exists. I think we want to manually destroy the datagov.us zones and then manually import the data.gov existing ones.
```
  # aws_route53_zone.zone[0] must be replaced
-/+ resource "aws_route53_zone" "zone" {
      + force_destroy = false
      ~ id            = "********************" -> (known after apply)
      ~ name          = "ssb-staging.datagov.us." -> "ssb-staging.data.gov" # forces replacement
      ~ name_servers  = [
          - "ns-1148.awsdns-15.org",
          - "ns-1937.awsdns-50.co.uk",
          - "ns-377.awsdns-47.com",
          - "ns-965.awsdns-56.net",
        ] -> (known after apply)
      - tags          = {} -> null
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      ~ zone_id       = "********************" -> (known after apply)
        # (1 unchanged attribute hidden)
    }
```

The code change looks good though.